/*
: Напишите программу, которая
принимает на вход число N и выдаёт
произведение чисел от 1 до N.
4 -> 24
5 -> 120
*/
Console.Clear();
Console.Write("Введите число:");
int num = Convert.ToInt32(Console.ReadLine());


